personal/50_myemacs.org
* Converting my emacs configuration to literate programming
:PROPERTIES:
:tangle:   yes
:END:

Some references:

- [[https://sites.google.com/site/steveyegge2/effective-emacs][Steve Yegge - Effective Emacs]]
- [[http://alexott.net/en/writings/emacs-devenv/EmacsCedet.html][A Gentle Introduction to CEDET]]
- [[https://github.com/sachac/.emacs.d][Sacha Chua's emacs.d]]
- [[http://sachachua.com/blog/2014/12/emacs-configuration-use-package/][Sacha explains use-package]]
- [[http://www.lunaryorn.com/2015/01/06/my-emacs-configuration-with-use-package.html][Sebastian Wiesner's configuration with use-package]]

#+BEGIN_SRC elisp
(require 'use-package)
#+END_SRC

** General settings

#+BEGIN_SRC elisp
(require 'use-package)

;; emacs should ask before carrying out C-x C-c
(defvar confirm-kill-emacs 'yes-or-no-p)

;; default value of 'midnight-hook is 'clean-buffer-list
;; I do not want emacs to close all my buffers every night
(remove-hook 'midnight-hook 'clean-buffer-list)

(setq prelude-guru nil)                 ; enable keyboard arrow keys for navigation

(use-package auto-compile
  :ensure t
  :init
    (setq load-prefer-newer t)
  :config
    (progn
      (auto-compile-on-load-mode 1)
      (auto-compile-on-save-mode 1)
    ))
#+END_SRC

** Markdown editing & preview

#+BEGIN_SRC elisp :results silent
(defun markdown-preview-file ()
  "Run Marked on the current file and revert the buffer"
  (interactive)
  (shell-command
   (format "open -a /Applications/Marked\\ 2.app %s"
           (shell-quote-argument (buffer-file-name))))
  )
#+END_SRC

** Software Development

*** minor modes

#+BEGIN_SRC elisp
  ;; show fill column
  (add-hook 'prog-mode-hook 'fci-mode)

  ;; show line numbers
  (setq linum-format "%4d ")
  (add-hook 'prog-mode-hook 'linum-mode)
  ;; scss-mode (for CSS, SASS) is not derived from prog-mode
  (add-hook 'scss-mode-hook 'linum-mode)

  ;; use markdown-mode for .txt files
  (add-to-list 'auto-mode-alist '("\\.txt\\'" . markdown-mode))
  ;; j2-mode for .es6 files
  (add-to-list 'auto-mode-alist '("\\.es6\\'" . js2-mode))

  (use-package hlinum
    :ensure t
    :config
    (hlinum-activate)
    )
#+END_SRC

*** development settings

#+BEGIN_SRC elisp
(setq whitespace-line-column 100)

(setq comment-empty-lines t)

(defun align-to-equals (begin end)
  "Align region to equal signs"
  (interactive "r")
  (align-regexp begin end "\\(\\s-*\\)=" 1 1 ))

;; http://www.emacswiki.org/emacs/AutoIndentation
(add-hook 'prog-mode-hook '(lambda ()
                             (local-set-key (kbd "RET") 'newline-and-indent)))

(add-hook 'prog-mode-hook
          (lambda ()
            (when buffer-file-name
              (add-hook 'after-save-hook
                        'check-parens
                        nil t))))

;; http://emacsredux.com/blog/2013/07/24/highlight-comment-annotations/
;; TODO consider alternatives at http://www.emacswiki.org/emacs/FixmeMode

(defun font-lock-comment-annotations ()
  "Highlight a bunch of well known comment annotations.

This functions should be added to the hooks of major modes for programming."
  (font-lock-add-keywords
   nil '(("\\<\\(FIX\\(ME\\)?\\|TODO\\|OPTIMIZE\\|HACK\\|REFACTOR\\)\b"
          1 font-lock-warning-face t))))

(add-hook 'prog-mode-hook 'font-lock-comment-annotations)

(use-package auto-complete
  :ensure t
  :config
  (progn
    (require 'auto-complete-config)
    (ac-config-default)
    (define-key ac-mode-map (kbd "C-c ,") 'auto-complete)
  )
)
#+END_SRC

*** [[https://github.com/purcell/ruby-hash-syntax][ruby-hash-syntax]]

Toggle ruby hash syntax between classic and 1.9 styles.

#+BEGIN_SRC elisp :results silent
  (use-package ruby-hash-syntax
    :ensure t
  )
#+END_SRC

*** ruby development

- ruby-mode (standard)
- ruby-refactor-mode: C-c C-r prefix commands; unchanged since July 2014 (diminished to blank)
- subword-mode (diminished to comma): treats subwords in code as words for nav
- whitespace-mode (diminished to ws): reveals loose whitespace
- projectile-rails-mode

#+BEGIN_SRC elisp
(use-package ruby-refactor
  :ensure t
  :config
  (add-hook 'ruby-mode-hook 'ruby-refactor-mode-launch)
)

;; inferior ruby
(defun ruby-reload-and-go ()
  "Send current buffer file to the inferior Ruby.
Then switch to the process buffer."
  (interactive)
  (comint-check-source buffer-file-name) ; Check to see if buffer needs saved.
  (comint-send-string (inf-ruby-proc) (concat "(load \""
                                              (buffer-file-name)
                                              "\"\)\n"))
  (ruby-switch-to-inf t))

(add-hook 'projectile-mode-hook 'projectile-rails-on)
#+END_SRC

*** SQL development

Emacs has no indentation built in for SQL. This seems to be a rough
start. Also see this: [[http://stackoverflow.com/questions/24397274/writing-php-with-sql-queries-in-emacs/24659949#24659949][sql-indent-string]]

#+BEGIN_SRC elisp
(use-package sql-indent
  :ensure t
)
#+END_SRC

** Navigation

Lucas Bonnet's buffer-move package.

#+BEGIN_SRC elisp
  (use-package buffer-move
    :ensure t
    :bind (
           ("C-H-<left>" . buf-move-left)
           ("C-H-<right>" . buf-move-right)
           )
    )
#+END_SRC

#+RESULTS:

** Various private functions

Upcasing a region

#+BEGIN_SRC elisp
(defun upcase-region-or-word (numwords)
  "Upcase a region if selected, otherwise the next word (or words if prefix argument is provided)."
  (interactive "p")
  (if (region-active-p)
      (upcase-region (region-beginning) (region-end))
    (upcase-word numwords)))
#+END_SRC

Commenting code

#+BEGIN_SRC elisp
(defun comment-or-uncomment-region-or-line ()
  "Comments or uncomments the region or the current line if there's no active region."
  (interactive)
  (let (beg end)
    (if (region-active-p)
        (setq beg (region-beginning) end (region-end))
      (setq beg (line-beginning-position) end (line-end-position)))
    (comment-or-uncomment-region beg end)
    (forward-line)))


#+END_SRC
** Copy region without newlines

- [[https://emacs.stackexchange.com/questions/1051/copy-region-from-emacs-without-newlines][my stackexchange post]]
- [[https://gist.github.com/xahlee/d364cbbff9b3abd12d29][improved version from Xah Lee]]

#+BEGIN_SRC elisp
(defun compact-uncompact-block ()
  "Remove or add line ending chars on current paragraph.
This command is similar to a toggle of `fill-paragraph'.
When there is a text selection, act on the region."
  (interactive)

  ;; This command symbol has a property “'stateIsCompact-p”.
  (let (currentStateIsCompact (bigFillColumnVal 90002000) (deactivate-mark nil))
    ;; 90002000 is just random. you can use `most-positive-fixnum'

    (save-excursion
      ;; Determine whether the text is currently compact.
      (setq currentStateIsCompact
            (if (eq last-command this-command)
                (get this-command 'stateIsCompact-p)
              (if (> (- (line-end-position) (line-beginning-position)) fill-column) t nil) ) )

      (if (region-active-p)
          (if currentStateIsCompact
              (fill-region (region-beginning) (region-end))
            (let ((fill-column bigFillColumnVal))
              (fill-region (region-beginning) (region-end))) )
        (if currentStateIsCompact
            (fill-paragraph nil)
          (let ((fill-column bigFillColumnVal))
            (fill-paragraph nil)) ) )

      (put this-command 'stateIsCompact-p (if currentStateIsCompact nil t)) ) ) )

(defun my-copy-simple (&optional beg end)
  "Save the current region (or line) to the `kill-ring' after stripping extra whitespace and new lines"
  (interactive
   (if (region-active-p)
       (list (region-beginning) (region-end))
     (list (line-beginning-position) (line-end-position))))
  (let ((my-text (buffer-substring-no-properties beg end)))
    (with-temp-buffer
      (insert my-text)
      (goto-char 1)
      (while (looking-at "[ \t\n]")
        (delete-char 1))
      (let ((fill-column 9333999))
        (fill-region (point-min) (point-max)))
      (kill-region (point-min) (point-max)))))

;; bindings
(global-set-key (kbd "C-c q") 'compact-uncompact-block)
(global-set-key (kbd "s-C") 'my-copy-simple)
#+END_SRC

** Highlight indentation columns in code

#+BEGIN_SRC elisp
  (use-package highlight-indentation
    :ensure t
    :config
    (progn
      (set-face-background 'highlight-indentation-face "#222")
      (set-face-background 'highlight-indentation-current-column-face "#444")
      (add-hook 'prog-mode-hook
                (lambda ()
                  (highlight-indentation-mode)
                  (highlight-indentation-current-column-mode)
                  ))
      )
    )
#+END_SRC

