personal/50_myemacs.org
** Database connections for my projects

- [[https://truongtx.me/2014/08/23/setup-emacs-as-an-sql-database-client/][setting up emacs as a SQL client]]

#+BEGIN_SRC elisp
(setq sql-connection-alist
      '((schoolistry (sql-product 'postgres)
                     (sql-port 5432)
                     (sql-server "localhost")
                     (sql-user "jmay")
                     (sql-password "")
                     (sql-database "schoolistry"))
        (schoolistry-prod (sql-product 'postgres)
                          (sql-port 5432)
                          (sql-server "remote")
                          (sql-user "remote")
                          (sql-password "remote")
                          (sql-database "postgres"))
;; using ssh port forwarding
;; requires password entry in buffer, but displays no prompt
        (veriphyr (sql-product 'postgres)
                  (sql-port 5100)
                  (sql-server "localhost")
                  (sql-user "jmay")
                  (sql-database "g1"))
        )
      )

(add-hook 'sql-interactive-mode-hook
          (lambda ()
            (toggle-truncate-lines t)))
#+END_SRC

