personal/50_myemacs.org
** All my org-mode stuff

- [[http://doc.norang.ca/org-mode.html][Org Mode - Organize Your Life In Plain Text!]]

#+BEGIN_SRC elisp
  ;; configuration for org mode, todo & journal capture
  ;;
  ;; Reference:
  ;;
  ;; https://www.gnu.org/software/emacs/manual/html_node/org/Template-expansion.html
  ;; http://members.optusnet.com.au/~charles57/GTD/datetree.html
  ;; https://www.gnu.org/software/emacs/manual/html_node/org/Conflicts.html

  (setq org-export-with-smart-quotes t)

  ;; Make windmove work in org-mode:
  (add-hook 'org-shiftup-final-hook 'windmove-up)
  (add-hook 'org-shiftleft-final-hook 'windmove-left)
  (add-hook 'org-shiftdown-final-hook 'windmove-down)
  (add-hook 'org-shiftright-final-hook 'windmove-right)

  ;; (setq org-default-notes-file "~/.deft/notes.org")

  ;; force UTF-8
  (setq org-export-coding-system 'utf-8)

  (setq org-capture-templates
        '(
          ("t"
           "TODO"
           entry
           (file+headline "~/.deft/gtd.org" "Tasks")
           "* TODO %?\n  %i\n  %a")
          ("o"
           "Otherbase TODO"
           entry
           (file+headline "~/.deft/otherbase-todo.org" "Tasks")
           "* TODO %?\n  %i\n")
          ("v"
           "Veriphyr TODO"
           entry
           (file+headline "~/.deft/veriphyr-todo.org" "Tasks")
           "* TODO %?\n  %i\n")
          ("e"
           "Emacs TODO"
           entry
           (file+headline "~/.deft/emacs-todo.org" "Emacs TODO")
           "* TODO %?\n  %i\n")
          ("j"
           "Journal"
           entry
           (file+datetree "~/.deft/journal.org")
           "* %?\n%i\n")
          ("s"
           "Schoolistry Journal"
           entry
           (file+datetree "~/.deft/journal.org")
           "* %? :schoolistry:\n%i\n")
          )
        )

  ;; using deft with org-mode

  ;; (when (require 'deft nil 'noerror)
  ;;   (setq
  ;; ;;   deft-extension "org"
  ;;    deft-directory "~/.deft"
  ;;    deft-text-mode 'org-mode
  ;;    deft-auto-save-interval 0
  ;;   )
  ;;   (global-set-key (kbd "<f9>") 'deft))

  ;; 130718 currently I don't like the deft auto-save because it triggers whitespace-cleanup
  ;; couldn't turn it off once Deft has been loaded, needed to do this:
  ;; (cancel-function-timers 'deft-auto-save)

  ;; http://www.emacswiki.org/emacs/AutoFillMode
  (add-hook 'text-mode-hook 'turn-on-auto-fill)
  (add-hook 'org-mode-hook 'turn-on-auto-fill)
  (add-hook 'markdown-mode-hook 'turn-on-auto-fill)

  ;; for MobileOrg
  (setq org-mobile-directory "~/Dropbox/Apps/MobileOrg")
  (setq org-directory "~/Dropbox/Apps/MobileOrg")


  (defun my-org-export-change-options (plist backend)
    (cond
     ((equal backend 'html)
      (plist-put plist :with-toc nil)
      (plist-put plist :section-numbers t))
     ((equal backend 'md)
      (plist-put plist :with-toc nil)
      (plist-put plist :section-numbers nil)))
    plist)

  ;; (add-to-list 'org-export-filter-options-functions 'my-org-export-change-options)


  ;; idea for how to completely conceal/reveal the PROPERTIES blocks
  ;; https://stackoverflow.com/questions/17478260/completely-hide-the-properties-drawer-in-org-mode
  ;; (defun lawlist-org-cycle-hide-drawers (state)
  ;;   "Re-hide all drawers after a visibility state change."
  ;;   (when (and (derived-mode-p 'org-mode)
  ;;        (not (memq state '(overview folded contents))))
  ;;     (save-excursion
  ;;       (let* ((globalp (memq state '(contents all)))
  ;;              (beg (if globalp (point-min) (point)))
  ;;              (end (if globalp (point-max)
  ;;         (if (eq state 'children)
  ;;       (save-excursion (outline-next-heading) (point))
  ;;           (org-end-of-subtree t)))))
  ;;   (goto-char beg)
  ;;   (while (re-search-forward "^.*DEADLINE:.*$\\|^\\*\\* Someday.*$\\|^\\*\\* None.*$\\|^\\*\\* Planning.*$\\|^\\* TASKS.*$" end t)
  ;;      (save-excursion
  ;;     (beginning-of-line 1)
  ;;     (when (looking-at "^.*DEADLINE:.*$\\|^\\*\\* Someday.*$\\|^\\*\\* None.*$\\|^\\*\\* Planning.*$\\|^\\* TASKS.*$")
  ;;       (let ((b (match-end 0)))
  ;;   (if (re-search-forward
  ;;        "^[ \t]*:END:"
  ;;        (save-excursion (outline-next-heading) (point)) t)
  ;;       (outline-flag-region b (point-at-eol) t)
  ;;     (user-error ":END: line missing at position %s" b))))))))))

  ;; fontify code in code blocks
  (setq org-src-fontify-natively t)

  (use-package org-bullets
    :ensure t
    :config
    (progn
      (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
      )
    )


  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; install sql (includes postgresql) support for org-babel
  ;; http://orgmode.org/worg/org-contrib/babel/languages/ob-doc-sql.html
  ;; active Babel languages
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((sql . t)
     (sh . t)
     (python . t)))
  ;; add additional languages with '((language . t)))

  (defun babel-confirm (flag)
    "Report the setting of org-confirm-babel-evaluate.
  If invoked with C-u, toggle the setting"
    (interactive "P")
    (if (equal flag '(4))
        (setq org-confirm-babel-evaluate (not org-confirm-babel-evaluate)))
    (message "Babel evaluation confirmation is %s"
             (if org-confirm-babel-evaluate "on" "off")))

  ;; (org-add-link-type
  ;;  "yt"
  ;;  (lambda (handle)
  ;;    (browse-url (concat "https://www.youtube.com/embed/" handle)))
  ;;  (lambda (path desc backend)
  ;;    (cl-case backend
  ;;      ;; You may want to change your width and height.
  ;;      (html (format "<iframe width=\"440\" height=\"335\" src=\"https://www.youtube.com/embed/%s\" frameborder=\"0\" allowfullscreen>%s</iframe>"
  ;;                    path (or desc "")))
  ;;      (latex (format "\href{%s}{%s}" path (or desc "video"))))))

  (use-package org-download
    :ensure t)

  ;; Turn off ispell checking inside org mode source blocks
  ;; NOT WORKING ON 150824
  ;; http://endlessparentheses.com/ispell-and-org-mode.html
  ;; (defun endless/org-ispell ()
  ;;   "Configure `ispell-skip-region-alist' for `org-mode'."
  ;;   (make-local-variable 'ispell-skip-region-alist)
  ;;   (add-to-list 'ispell-skip-region-alist '(org-property-drawer-re))
  ;;   (add-to-list 'ispell-skip-region-alist '("~" "~"))
  ;;   (add-to-list 'ispell-skip-region-alist '("=" "="))
  ;;   (add-to-list 'ispell-skip-region-alist '("^#\\+BEGIN_SRC" . "^#\\+END_SRC")))
  ;; (add-hook 'org-mode-hook #'endless/org-ispell)

  (setq org-imenu-depth 4)


  ;; http://pragmaticemacs.com/emacs/wrap-text-in-an-org-mode-block/
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; function to wrap blocks of text in org templates                       ;;
  ;; e.g. latex or src etc                                                  ;;
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  (defun org-begin-template ()
    "Make a template at point."
    (interactive)
    (if (org-at-table-p)
        (call-interactively 'org-table-rotate-recalc-marks)
      (let* ((choices '(("s" . "SRC")
                        ("e" . "EXAMPLE")
                        ("q" . "QUOTE")
                        ("v" . "VERSE")
                        ("c" . "CENTER")
                        ("l" . "LaTeX")
                        ("h" . "HTML")
                        ("a" . "ASCII")))
             (key
              (key-description
               (vector
                (read-key
                 (concat (propertize "Template type: " 'face 'minibuffer-prompt)
                         (mapconcat (lambda (choice)
                                      (concat (propertize (car choice) 'face 'font-lock-type-face)
                                              ": "
                                              (cdr choice)))
                                    choices
                                    ", ")))))))
        (let ((result (assoc key choices)))
          (when result
            (let ((choice (cdr result)))
              (cond
               ((region-active-p)
                (let ((start (region-beginning))
                      (end (region-end)))
                  (goto-char end)
                  (insert "#+END_" choice "\n")
                  (goto-char start)
                  (insert "#+BEGIN_" choice "\n")))
               (t
                (insert "#+BEGIN_" choice "\n")
                (save-excursion (insert "#+END_" choice))))))))))


  ;; http://endlessparentheses.com/changing-the-org-mode-ellipsis.html
  (setq org-ellipsis "⤵")

#+END_SRC

